In [1]:
import numpy as np
import pandas as pd

In [39]:
data = {
    'Name':['Charlie', 'John', 'Adam', 'John', 'Adam'],
    'Age':[12, 54, 33, 23, 53],
    'City':['Tashkent', 'USA', 'Russian', 'USA', 'Russian']
}
New_data = [[2, 4, 5], [4, 32, 6], [6, 8, 3]]

df = pd.DataFrame(data)
df2 = pd.DataFrame(New_data)
print(df)

      Name  Age      City
0  Charlie   12  Tashkent
1     John   54       USA
2     Adam   33   Russian
3     John   23       USA
4     Adam   53   Russian

In [40]:
# First 4 rows
df.head()

      Name  Age      City
0  Charlie   12  Tashkent
1     John   54       USA
2     Adam   33   Russian
3     John   23       USA
4     Adam   53   Russian

In [41]:
# Last 4 rows
df.tail()

      Name  Age      City
0  Charlie   12  Tashkent
1     John   54       USA
2     Adam   33   Russian
3     John   23       USA
4     Adam   53   Russian

In [42]:
# Length of list
print(df2.shape)

(3, 3)

In [43]:
# Column names
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [46]:
# Data types and memory
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [48]:
# Statistic numbers (Count, Mean, Std, min, max)
df.describe()

             Age
count   5.000000
mean   35.000000
std    18.452642
min    12.000000
25%    23.000000
50%    33.000000
75%    53.000000
max    54.000000

In [56]:
# Access data
print(df['Name'])
print('\n')
print(df2[0])

# Multiple data
print('\nMultiple data: ')
print(df[['Name', 'Age']])

0    Charlie
1       John
2       Adam
3       John
4       Adam
Name: Name, dtype: object


0    2
1    4
2    6
Name: 0, dtype: int64

Multiple data:
      Name  Age
0  Charlie   12
1     John   54
2     Adam   33
3     John   23
4     Adam   53

In [57]:
# Access a row by id
# Row with index 0
df.loc[0]

Name     Charlie
Age           12
City    Tashkent
Name: 0, dtype: object

In [59]:
#Second row (position-based)
df.iloc[1]

Name    John
Age       54
City     USA
Name: 1, dtype: object

In [61]:
# Fillterning rows
# filter row where Age > 34
print(df[df['Age'] > 34])

   Name  Age     City
1  John   54      USA
4  Adam   53  Russian

In [62]:
# Filtering data where city == 'USA'
print(df[df['City'] == 'USA'])

   Name  Age City
1  John   54  USA
3  John   23  USA

In [11]:
#Create a DataFrame with 3 columns: "Product", "Price", and "Quantity"
table = {"Product":["a1", "a2", "a3"], "Price":[2, 5, 4], "Quantity":[2, 1, 3]}
new_ = pd.DataFrame(table)
new_

  Product  Price  Quantity
0      a1      2         2
1      a2      5         1
2      a3      4         3

In [8]:
#Add a new column "total" that equals Price * Quantity
new_["total"] = new_["Price"] * new_["Quantity"]
new_

  Product  Price  Quantity  total
0      a1      2         2      4
1      a2      5         1      5
2      a3      4         3     12

In [10]:
#Filter and show only products where "total" is more than 5
new_[new_["total"] > 5]

  Product  Price  Quantity  total
2      a3      4         3     12